Repository: gowtham611/XYLEM
Catalog: lib/l10n/app_*.arb
Languages: kn

# appTitle
source: Smart Agriculture Pro
kn: ಸ್ಮಾರ್ಟ್ ಕೃಷಿ ಪ್ರೋ

source: Dashboard
kn: ಡ್ಯಾಶ್‌ಬೋರ್ಡ್

source: Sensors
kn: ಸಂವೇದಕಗಳು

source: Assistant
kn: ಸಹಾಯಕ

source: Weather
kn: ಹವಾಮಾನ

source: Market
kn: ಮಾರುಕಟ್ಟೆ

source: Schemes
kn: ಯೋಜನೆಗಳು

# goodMorning
source: Good Morning, Farmer!
kn: ಶುಭೋದಯ, ರೈತರೇ!

# farmStatus
source: Your farm is looking great today. Check your sensors and get AI-powered recommendations.
kn: ನಿಮ್ಮ ಕೃಷಿ ಇಂದು ಚೆನ್ನಾಗಿ ಕಾಣುತ್ತಿದೆ. ನಿಮ್ಮ ಸಂವೇದಕಗಳನ್ನು ಪರಿಶೀಲಿಸಿ ಮತ್ತು AI ಶಿಫಾರಸುಗಳನ್ನು ಪಡೆಯಿರಿ.

source: Temperature
kn: ತಾಪಮಾನ

source: Humidity
kn: ಆರ್ದ್ರತೆ

source: Soil Health
kn: ಮಣ್ಣಿನ ಆರೋಗ್ಯ

source: Predicted Crop
kn: ಭವಿಷ್ಯದ ಬೆಳೆ

source: Market Price
kn: ಮಾರುಕಟ್ಟೆ ಬೆಲೆ

source: Active Alerts
kn: ಸಕ್ರಿಯ ಎಚ್ಚರಿಕೆಗಳು

source: AI Assistant
kn: AI ಸಹಾಯಕ

source: Voice & Chat Support
kn: ಧ್ವನಿ ಮತ್ತು ಚಾಟ್ ಬೆಂಬಲ

source: Weather Alerts
kn: ಹವಾಮಾನ ಎಚ್ಚರಿಕೆಗಳು

source: Smart Forecasting
kn: ಸ್ಮಾರ್ಟ್ ಮುನ್ಸೂಚನೆ

source: Marketplace
kn: ಮಾರುಕಟ್ಟೆ

# connectBuyers
source: Connect with Buyers
kn: ಖರೀದಿದಾರರೊಂದಿಗೆ ಸಂಪರ್ಕ

source: Gov. Schemes
kn: ಸರ್ಕಾರಿ ಯೋಜನೆಗಳು

# subsidyInfo
source: Subsidy Information
kn: ಸಬ್ಸಿಡಿ ಮಾಹಿತಿ

source: Recent Activity
kn: ಇತ್ತೀಚಿನ ಚಟುವಟಿಕೆ

source: No Sensor Data
kn: ಸಂವೇದಕ ಡೇಟಾ ಇಲ್ಲ

# connectESP32
source: Connect to ESP32 to start monitoring
kn: ಮಾನಿಟರಿಂಗ್ ಪ್ರಾರಂಭಿಸಲು ESP32 ಗೆ ಸಂಪರ್ಕಿಸಿ

source: Start Monitoring
kn: ಮಾನಿಟರಿಂಗ್ ಪ್ರಾರಂಭಿಸಿ

source: Stop Monitoring
kn: ಮಾನಿಟರಿಂಗ್ ನಿಲ್ಲಿಸಿ

source: Connecting...
kn: ಸಂಪರ್ಕಿಸುತ್ತಿದೆ...

source: Connected
kn: ಸಂಪರ್ಕಗೊಂಡಿದೆ

source: Disconnected
kn: ಸಂಪರ್ಕ ಕಡಿದುಕೊಂಡಿದೆ

# govSchemesAvailable
source: Government Schemes Available
kn: ಸರ್ಕಾರಿ ಯೋಜನೆಗಳು ಲಭ್ಯವಿದೆ

# searchingSchemes
source: Searching schemes for your region...
kn: ನಿಮ್ಮ ಪ್ರದೇಶಕ್ಕಾಗಿ ಯೋಜನೆಗಳನ್ನು ಹುಡುಕುತ್ತಿದ್ದೇವೆ...

# noSchemesFound
source: No schemes found for your region
kn: ನಿಮ್ಮ ಪ್ರದೇಶಕ್ಕೆ ಯಾವುದೇ ಯೋಜನೆಗಳು ಕಂಡುಬಂದಿಲ್ಲ

source: Eligibility
kn: ಅರ್ಹತೆ

source: Amount
kn: ಮೊತ್ತ

source: Deadline
kn: ಅಂತಿಮ ದಿನಾಂಕ

source: Apply Now
kn: ಈಗ ಅರ್ಜಿ ಸಲ್ಲಿಸಿ

source: Language
kn: ಭಾಷೆ

source: Select Language
kn: ಭಾಷೆ ಆಯ್ಕೆಮಾಡಿ

source: Monitor
kn: ಮಾನಿಟರ್

source: Live Sensor Data
kn: ನೇರ ಸಂವೇದಕ ಡೇಟಾ

source: Predict
kn: ಭವಿಷ್ಯ

source: AI Recommendations
kn: AI ಶಿಫಾರಸುಗಳು

source: Weather Forecast
kn: ಹವಾಮಾನ ಮುನ್ಸೂಚನೆ

source: Price Tracker
kn: ಬೆಲೆ ಟ್ರ್ಯಾಕರ್

source: Real-Time Monitoring
kn: ನೇರ ಸಮಯ ಮಾನಿಟರಿಂಗ್

# liveSensorDataFromESP32
source: Live sensor data from your ESP32 devices
kn: ನಿಮ್ಮ ESP32 ಸಾಧನಗಳಿಂದ ನೇರ ಸಂವೇದಕ ಡೇಟಾ

# noSensorDataAvailable
source: No Sensor Data
kn: ಸಂವೇದಕ ಡೇಟಾ ಇಲ್ಲ

# connectESP32ToStart
source: Connect your ESP32 sensors to start monitoring
kn: ಮಾನಿಟರಿಂಗ್ ಪ್ರಾರಂಭಿಸಲು ನಿಮ್ಮ ESP32 ಸಂವೇದಕಗಳನ್ನು ಸಂಪರ್ಕಿಸಿ

source: Live Sensor Readings
kn: ನೇರ ಸಂವೇದಕ ರೀಡಿಂಗ್‌ಗಳು

source: LIVE
kn: ನೇರ

source: Soil pH
kn: ಮಣ್ಣಿನ pH

source: Moisture
kn: ತೇವಾಂಶ

source: Nitrogen
kn: ನೈಟ್ರೋಜನ್

source: Phosphorus
kn: ಫಾಸ್ಫರಸ್

source: Potassium
kn: ಪೊಟ್ಯಾಸಿಯಮ್

source: Sensor Status
kn: ಸಂವೇದಕ ಸ್ಥಿತಿ

source: Data History
kn: ಡೇಟಾ ಇತಿಹಾಸ

source: Last 24 Hours
kn: ಕೊನೆಯ 24 ಗಂಟೆಗಳು

# noHistoryData
source: No history data available
kn: ಯಾವುದೇ ಇತಿಹಾಸ ಡೇಟಾ ಲಭ್ಯವಿಲ್ಲ

source: Sensor Status Analysis
kn: ಸಂವೇದಕ ಸ್ಥಿತಿ ವಿಶ್ಲೇಷಣೆ

source: OPTIMAL
kn: ಅನುಕೂಲ

source: Optimal Range
kn: ಅನುಕೂಲ ವ್ಯಾಪ್ತಿ

source: Recent Data Log
kn: ಇತ್ತೀಚಿನ ಡೇಟಾ ಲಾಗ್

source: readings
kn: ರೀಡಿಂಗ್‌ಗಳು

# secondsAgo
source: s ago
kn: ಸೆ ಹಿಂದೆ

# minutesAgo
source: m ago
kn: ನಿ ಹಿಂದೆ

# hoursAgo
source: h ago
kn: ಗಂ ಹಿಂದೆ

source: Prices
kn: ಬೆಲೆಗಳು

source: Trending
kn: ಟ್ರೆಂಡಿಂಗ್

source: News
kn: ಸುದ್ದಿ

source: Loading market data...
kn: ಮಾರುಕಟ್ಟೆ ಡೇಟಾ ಲೋಡ್ ಮಾಡಲಾಗುತ್ತಿದೆ...

source: Market Summary
kn: ಮಾರುಕಟ್ಟೆ ಸಾರಾಂಶ

source: Rising
kn: ಏರಿಕೆ

source: Falling
kn: ಕುಸಿತ

source: Stable
kn: ಸ್ಥಿರ

source: Last updated
kn: ಕೊನೆಯ ನವೀಕರಣ

source: Current Prices
kn: ಪ್ರಸ್ತುತ ಬೆಲೆಗಳು

source: per kg
kn: ಪ್ರತಿ ಕೆಜಿ

source: Price Change
kn: ಬೆಲೆ ಬದಲಾವಣೆ

source: Trending Crops
kn: ಟ್ರೆಂಡಿಂಗ್ ಬೆಳೆಗಳು

source: High Demand
kn: ಹೆಚ್ಚಿನ ಬೇಡಿಕೆ

source: Price Increasing
kn: ಬೆಲೆ ಹೆಚ್ಚುತ್ತಿದೆ

source: Seasonal Crop
kn: ಕಾಲೋಚಿತ ಬೆಳೆ

source: Market News
kn: ಮಾರುಕಟ್ಟೆ ಸುದ್ದಿ

source: Read More
kn: ಹೆಚ್ಚು ಓದಿ

source: Retry
kn: ಮರುಪ್ರಯತ್ನಿಸಿ

source: Market Error
kn: ಮಾರುಕಟ್ಟೆ ದೋಷ

source: Loading weather data...
kn: ಹವಾಮಾನ ಡೇಟಾ ಲೋಡ್ ಮಾಡಲಾಗುತ್ತಿದೆ...

source: Weather Error
kn: ಹವಾಮಾನ ದೋಷ

source: No Weather Data
kn: ಹವಾಮಾನ ಡೇಟಾ ಇಲ್ಲ

source: Weather Details
kn: ಹವಾಮಾನ ವಿವರಗಳು

source: Wind Speed
kn: ಗಾಳಿಯ ವೇಗ

source: Visibility
kn: ಗೋಚರತೆ

source: Feels Like
kn: ಅನುಭವವಾಗುತ್ತದೆ

source: Farming Recommendations
kn: ಕೃಷಿ ಶಿಫಾರಸುಗಳು

# updatedAt
source: Updated
kn: ನವೀಕರಿಸಲಾಗಿದೆ

source: AI Crop Advisor
kn: AI ಬೆಳೆ ಸಲಹೆಗಾರ

# intelligentCropPrediction
source: Intelligent crop prediction & recommendations
kn: ಬುದ್ಧಿವಂತ ಬೆಳೆ ಭವಿಷ್ಯ ಮತ್ತು ಶಿಫಾರಸುಗಳು

source: Check ONNX Runtime
kn: ONNX Runtime ಪರಿಶೀಲಿಸಿ

source: Run AI Prediction
kn: AI ಭವಿಷ್ಯ ರನ್ ಮಾಡಿ

source: Running...
kn: ರನ್ ಆಗುತ್ತಿದೆ...

source: Simulate
kn: ಸಿಮ್ಯುಲೇಟ್

source: No predictions yet
kn: ಇನ್ನೂ ಭವಿಷ್ಯವಾಣಿಗಳಿಲ್ಲ

source: No Prediction Data
kn: ಭವಿಷ್ಯವಾಣಿ ಡೇಟಾ ಇಲ್ಲ

# connectSensorsOrSimulate
source: Connect sensors or start simulation to get predictions
kn: ಭವಿಷ್ಯವಾಣಿಗಳನ್ನು ಪಡೆಯಲು ಸಂವೇದಕಗಳನ್ನು ಸಂಪರ್ಕಿಸಿ ಅಥವಾ ಸಿಮ್ಯುಲೇಷನ್ ಪ್ರಾರಂಭಿಸಿ

source: Suitability
kn: ಸೂಕ್ತತೆ

source: Soil Quality
kn: ಮಣ್ಣಿನ ಗುಣಮಟ್ಟ

source: Growth Potential
kn: ಬೆಳವಣಿಗೆಯ ಸಾಮರ್ಥ್ಯ

source: Risk Level
kn: ಅಪಾಯ ಮಟ್ಟ

source: Season Match
kn: ಕಾಲೋಚಿತ ಹೊಂದಾಣಿಕೆ

source: Excellent
kn: ಅತ್ಯುತ್ತಮ

source: Good
kn: ಒಳ್ಳೆಯದು

source: Fair
kn: ಸರಾಸರಿ

source: Very High
kn: ಅತಿ ಹೆಚ್ಚು

source: High
kn: ಹೆಚ್ಚು

source: Moderate
kn: ಮಧ್ಯಮ

source: Medium
kn: ಮಧ್ಯಮ

source: Low
kn: ಕಡಿಮೆ

source: Tomatoes
kn: ಟೊಮೇಟೊಗಳು

source: Potatoes
kn: ಆಲೂಗೆಡ್ಡೆಗಳು

source: Leafy Greens
kn: ಎಲೆಕೋಸು ತರಕಾರಿಗಳು

source: Peppers
kn: ಮೆಣಸಿನಕಾಯಿಗಳು

source: Legumes
kn: ದ್ವಿದಳ ಧಾನ್ಯಗಳು

source: Herbs
kn: ಗಿಡಮೂಲಿಕೆಗಳು

# optimalPHHighNitrogen
source: Optimal pH and high nitrogen levels
kn: ಅತ್ಯುತ್ತಮ pH ಮತ್ತು ಹೆಚ್ಚಿನ ನೈಟ್ರೋಜನ್ ಮಟ್ಟಗಳು

# goodPHPhosphorus
source: Good pH and phosphorus levels
kn: ಒಳ್ಳೆಯ pH ಮತ್ತು ಫಾಸ್ಫರಸ್ ಮಟ್ಟಗಳು

# highNitrogenMoisture
source: High nitrogen and moisture content
kn: ಹೆಚ್ಚಿನ ನೈಟ್ರೋಜನ್ ಮತ್ತು ತೇವಾಂಶದ ವಿಷಯ

# goodPHPotassium
source: Good pH and potassium levels
kn: ಒಳ್ಳೆಯ pH ಮತ್ತು ಪೊಟ್ಯಾಸಿಯಮ್ ಮಟ್ಟಗಳು

# nitrogenFixers
source: Nitrogen fixers, improve soil quality
kn: ನೈಟ್ರೋಜನ್ ಫಿಕ್ಸರ್‌ಗಳು, ಮಣ್ಣಿನ ಗುಣಮಟ್ಟವನ್ನು ಸುಧಾರಿಸುತ್ತವೆ

# adaptableToSoil
source: Adaptable to various soil conditions
kn: ವಿವಿಧ ಮಣ್ಣಿನ ಪರಿಸ್ಥಿತಿಗಳಿಗೆ ಹೊಂದಿಕೊಳ್ಳುವ

source: Government Schemes Screen
kn: ಸರ್ಕಾರಿ ಯೋಜನೆಗಳ ಪರದೆ

source: Sensor Connection
kn: ಸಂವೇದಕ ಸಂಪರ್ಕ

source: Status
kn: ಸ್ಥಿತಿ

source: Data Points
kn: ಡೇಟಾ ಪಾಯಿಂಟ್‌ಗಳು

source: Rate
kn: ದರ

# connectToESP32ForRealData
source: Connect to ESP32 for real sensor data:
kn: ನೈಜ ಸಂವೇದಕ ಡೇಟಾಕ್ಕಾಗಿ ESP32 ಗೆ ಸಂಪರ್ಕಿಸಿ:

source: ESP32 IP Address
kn: ESP32 IP ವಿಳಾಸ

source: Port
kn: ಪೋರ್ಟ್

# connectToESP32Button
source: Connect to ESP32
kn: ESP32 ಗೆ ಸಂಪರ್ಕಿಸಿ

source: Use Test Data
kn: ಪರೀಕ್ಷಾ ಡೇಟಾ ಬಳಸಿ

source: Test Data Mode Active
kn: ಪರೀಕ್ಷಾ ಡೇಟಾ ಮೋಡ್ ಸಕ್ರಿಯ

source: Stop Test
kn: ಪರೀಕ್ಷೆ ನಿಲ್ಲಿಸಿ

# usingSimulatedData
source: Using simulated sensor data for testing purposes.
kn: ಪರೀಕ್ಷಾ ಉದ್ದೇಶಗಳಿಗಾಗಿ ಸಿಮ್ಯುಲೇಟೆಡ್ ಸಂವೇದಕ ಡೇಟಾವನ್ನು ಬಳಸಲಾಗುತ್ತಿದೆ.

source: ESP32 Connected
kn: ESP32 ಸಂಪರ್ಕಗೊಂಡಿದೆ

source: Disconnect
kn: ಸಂಪರ್ಕ ಕಡಿದುಕೊಳ್ಳಿ

# receivingLiveData
source: Receiving live data from ESP32 every 3 seconds.
kn: ಪ್ರತಿ 3 ಸೆಕೆಂಡುಗಳಿಗೊಮ್ಮೆ ESP32 ನಿಂದ ನೇರ ಡೇಟಾ ಸ್ವೀಕರಿಸಲಾಗುತ್ತಿದೆ.

source: Connecting to ESP32...
kn: ESP32 ಗೆ ಸಂಪರ್ಕಿಸಲಾಗುತ್ತಿದೆ...

source: Connection Error:
kn: ಸಂಪರ್ಕ ದೋಷ:

source: Latest Sensor Reading:
kn: ಇತ್ತೀಚಿನ ಸಂವೇದಕ ರೀಡಿಂಗ್:

source: Simulation Mode Active
kn: ಸಿಮ್ಯುಲೇಷನ್ ಮೋಡ್ ಸಕ್ರಿಯ

source: Refresh
kn: ರಿಫ್ರೆಶ್

# aiCropAdvisorTitle
source: AI Crop Advisor
kn: AI ಬೆಳೆ ಸಲಹೆಗಾರ

# smartCropPredictions
source: Smart crop predictions · Soil insights · Farming tips
kn: ಸ್ಮಾರ್ಟ್ ಬೆಳೆ ಭವಿಷ್ಯವಾಣಿಗಳು · ಮಣ್ಣಿನ ಒಳನೋಟಗಳು · ಕೃಷಿ ಸಲಹೆಗಳು

# runningDots
source: Running...
kn: ರನ್ ಆಗುತ್ತಿದೆ...

# runAIPredictionButton
source: Run AI Prediction
kn: AI ಭವಿಷ್ಯವಾಣಿ ರನ್ ಮಾಡಿ

# simulateButton
source: Simulate
kn: ಸಿಮ್ಯುಲೇಟ್

# noPredictionsYetTitle
source: No predictions yet
kn: ಇನ್ನೂ ಭವಿಷ್ಯವಾಣಿಗಳಿಲ್ಲ

# runAIPredictionToSeeResults
source: Run the AI prediction to see results
kn: ಫಲಿತಾಂಶಗಳನ್ನು ನೋಡಲು AI ಭವಿಷ್ಯವಾಣಿಯನ್ನು ರನ್ ಮಾಡಿ

source: Prediction error:
kn: ಭವಿಷ್ಯವಾಣಿ ದೋಷ:

# noPredictionDataTitle
source: No Prediction Data
kn: ಭವಿಷ್ಯವಾಣಿ ಡೇಟಾ ಇಲ್ಲ

# connectSensorsOrStartSimulation
source: Connect sensors or start simulation to get predictions
kn: ಭವಿಷ್ಯವಾಣಿಗಳನ್ನು ಪಡೆಯಲು ಸಂವೇದಕಗಳನ್ನು ಸಂಪರ್ಕಿಸಿ ಅಥವಾ ಸಿಮ್ಯುಲೇಷನ್ ಪ್ರಾರಂಭಿಸಿ

# startingDots
source: Starting...
kn: ಪ್ರಾರಂಭವಾಗುತ್ತಿದೆ...

# simulateAndRun
source: Simulate & Run
kn: ಸಿಮ್ಯುಲೇಟ್ ಮತ್ತು ರನ್

# recommendedCropsTitle
source: Recommended Crops
kn: ಶಿಫಾರಸು ಮಾಡಿದ ಬೆಳೆಗಳು

# modelRecommendationSubtitle
source: Model recommendation
kn: ಮಾದರಿ ಶಿಫಾರಸು

# confidenceLabel
source: Confidence
kn: ವಿಶ್ವಾಸ

source: Top alternatives
kn: ಉನ್ನತ ಪರ್ಯಾಯಗಳು

# soilLabel
source: Soil
kn: ಮಣ್ಣು

# issuesLabel
source: issues
kn: ಸಮಸ್ಯೆಗಳು

# tipsLabel
source: Tips
kn: ಸಲಹೆಗಳು

# primaryLabel
source: Primary
kn: ಪ್ರಾಥಮಿಕ

# advisoryLabel
source: Advisory
kn: ಸಲಹಾ

# viewSoilRecommendationsTitle
source: View soil recommendations
kn: ಮಣ್ಣಿನ ಶಿಫಾರಸುಗಳನ್ನು ವೀಕ್ಷಿಸಿ

# noMajorSoilIssues
source: No major soil issues detected.
kn: ಯಾವುದೇ ಪ್ರಮುಖ ಮಣ್ಣಿನ ಸಮಸ್ಯೆಗಳು ಪತ್ತೆಯಾಗಿಲ್ಲ.

# optimalPHHighNitrogenReason
source: Optimal pH and high nitrogen levels
kn: ಅತ್ಯುತ್ತಮ pH ಮತ್ತು ಹೆಚ್ಚಿನ ನೈಟ್ರೋಜನ್ ಮಟ್ಟಗಳು

# goodPHPhosphorusReason
source: Good pH and phosphorus levels
kn: ಒಳ್ಳೆಯ pH ಮತ್ತು ಫಾಸ್ಫರಸ್ ಮಟ್ಟಗಳು

# highNitrogenMoistureReason
source: High nitrogen and moisture content
kn: ಹೆಚ್ಚಿನ ನೈಟ್ರೋಜನ್ ಮತ್ತು ತೇವಾಂಶದ ವಿಷಯ

# goodPHPotassiumReason
source: Good pH and potassium levels
kn: ಒಳ್ಳೆಯ pH ಮತ್ತು ಪೊಟ್ಯಾಸಿಯಮ್ ಮಟ್ಟಗಳು

# nitrogenFixersReason
source: Nitrogen fixers, improve soil quality
kn: ನೈಟ್ರೋಜನ್ ಫಿಕ್ಸರ್‌ಗಳು, ಮಣ್ಣಿನ ಗುಣಮಟ್ಟವನ್ನು ಸುಧಾರಿಸುತ್ತವೆ

# adaptableToSoilReason
source: Adaptable to various soil conditions
kn: ವಿವಿಧ ಮಣ್ಣಿನ ಪರಿಸ್ಥಿತಿಗಳಿಗೆ ಹೊಂದಿಕೊಳ್ಳುವ

# cropTomatoes
source: Tomatoes
kn: ಟೊಮೇಟೊಗಳು

# cropPotatoes
source: Potatoes
kn: ಆಲೂಗಡ್ಡೆಗಳು

# cropLeafyGreens
source: Leafy Greens
kn: ಎಲೆಕೋಸು ತರಕಾರಿಗಳು

# cropPeppers
source: Peppers
kn: ಮೆಣಸಿನಕಾಯಿಗಳು

# cropLegumes
source: Legumes
kn: ದ್ವಿದಳ ಧಾನ್ಯಗಳು

# cropHerbs
source: Herbs
kn: ಗಿಡಮೂಲಿಕೆಗಳು

# cropRice
source: Rice
kn: ಅಕ್ಕಿ

# cropMaize
source: Maize
kn: ಮಕ್ಕೆಜೋಳ

# cropChickpea
source: Chickpea
kn: ಕಡಲೆಕಾಯಿ

# cropKidneybeans
source: Kidney Beans
kn: ರಾಜಮಾ ಬೀನ್ಸ್

# cropPigeonpeas
source: Pigeon Peas
kn: ತೋಗರಿ ಬೇಳೆ

# cropMothbeans
source: Moth Beans
kn: ಮೋಥ್ ಬೀನ್ಸ್

# cropMungbean
source: Mung Bean
kn: ಹೆಸರು ಬೇಳೆ

# cropBlackgram
source: Black Gram
kn: ಉದ್ದಿನ ಬೇಳೆ

# cropLentil
source: Lentil
kn: ಮಸೂರ್ ದಾಳ

# cropPomegranate
source: Pomegranate
kn: ದಾಳಿಂಬೆ

# cropBanana
source: Banana
kn: ಬಾಳೆಹಣ್ಣು

# cropMango
source: Mango
kn: ಮಾವಿನಕಾಯಿ

# cropGrapes
source: Grapes
kn: ದ್ರಾಕ್ಷಿ

# cropWatermelon
source: Watermelon
kn: ಕಲ್ಲಂಗಡಿ

# cropMuskmelon
source: Muskmelon
kn: ಮಸ್ಕ್ ಮೆಲನ್

# cropApple
source: Apple
kn: ಸೇಬು

# cropOrange
source: Orange
kn: ಕಿತ್ತಳೆ ಹಣ್ಣು

# cropPapaya
source: Papaya
kn: ಪರಂಗಿ

# cropCoconut
source: Coconut
kn: ತೆಂಗಿನಕಾಯಿ

# cropCotton
source: Cotton
kn: ಹತ್ತಿ

# cropJute
source: Jute
kn: ಜೂಟ್

# cropCoffee
source: Coffee
kn: ಕಾಫಿ

source: Soil
kn: ಮಣ್ಣು

source: Overall
kn: ಸಮಗ್ರ
